Repository: nullhtp/feelu
Catalog: lib/l10n/app_*.arb
Languages: es, ru

source: Initializing services...
es: Inicializando servicios...
ru: Инициализация сервисов...

# initializationSuccessTitle
source: All services ready!
es: ¡Todos los servicios están listos!
ru: Все сервисы готовы!

# initializationSuccessSubtitle
source: Launching braille interface...
es: Abriendo la interfaz braille...
ru: Запускаем брайлевский интерфейс...

# initializationErrorTitle
source: Initialization failed: {serviceName}
es: Error al iniciar: {serviceName}
ru: Не удалось запустить: {serviceName}

# initializationErrorLabel
source: Error: {errorMessage}
ru: Ошибка: {errorMessage}

# retryButtonLabel
source: Retry
es: Reintentar
ru: Повторить

# brailleAssistantOutputTitle
source: ASSISTANT OUTPUT
es: RESPUESTA DEL ASISTENTE
ru: ОТВЕТ АССИСТЕНТА

# brailleDecoding
source: Decoding
es: Descodificando
ru: Расшифровка

# brailleSpeaking
source: Speaking...
es: Hablando...
ru: Озвучивание...

# braillePreparingAnswer
source: Preparing answer
es: Preparando respuesta
ru: Готовим ответ

# brailleNoText
source: No braille text to display
es: No hay texto braille para mostrar
ru: Нет текста для вывода шрифтом Брайля

# brailleDot1Label
source: DOT 1
es: PUNTO 1
ru: ТОЧКА 1

# brailleDot2Label
source: DOT 2
es: PUNTO 2
ru: ТОЧКА 2

# brailleDot3Label
source: DOT 3
es: PUNTO 3
ru: ТОЧКА 3

# brailleSpaceLabel
source: SPACE
es: ESPACIO
ru: ПРОБЕЛ

# brailleKeySemanticLabel
source: {keyName} key
es: Tecla {keyName}
ru: Клавиша {keyName}

# brailleKeySemanticHint
source: Tap to input braille dots
es: Toca para introducir puntos braille
ru: Нажмите, чтобы ввести точки Брайля

# photoTapToSee
source: Tap to see
es: Toca para ver
ru: Нажмите, чтобы увидеть

# photoCapturing
source: Capturing...
es: Capturando...
ru: Съёмка...

# photoDescribing
source: Describing...
es: Describiendo...
ru: Описание...

# photoInitializationError
source: Failed to initialize photo vibro: {error}
es: No se pudo iniciar foto-vibro: {error}
ru: Не удалось подготовить режим Фото-вибро: {error}

# photoCaptureError
source: Error capturing or processing the image: {error}
es: Error al capturar o procesar la imagen: {error}
ru: Ошибка при съёмке или обработке: {error}

# speechTapToListen
source: Tap to listen
es: Toca para escuchar
ru: Нажмите, чтобы слушать

# speechListening
source: Listening...
es: Escuchando...
ru: Слушаем...

# speechSummarizing
source: Summarizing...
es: Resumiendo...
ru: Подготавливаем сводку...

# serviceVibrationName
source: Vibration service
es: Servicio de vibración
ru: Сервис вибрации

# serviceVibrationDescription
source: Checking device vibration capabilities
es: Comprobando las capacidades de vibración del dispositivo
ru: Проверяем возможности вибрации устройства

# serviceCameraName
source: Camera service
es: Servicio de cámara
ru: Сервис камеры

# serviceCameraDescription
source: Initializing camera for photo recognition
es: Inicializando la cámara para el reconocimiento de fotos
ru: Инициализируем камеру для распознавания

# serviceTtsName
source: Text-to-speech
es: Texto a voz
ru: Синтез речи

# serviceTtsDescription
source: Initializing speech synthesis engine
es: Inicializando el motor de síntesis de voz
ru: Запуск движка синтеза речи

# serviceSpeechRecognitionName
source: Speech recognition
es: Reconocimiento de voz
ru: Распознавание речи

# serviceSpeechRecognitionDescription
source: Initializing speech recognition engine
es: Inicializando el motor de reconocimiento de voz
ru: Инициализируем движок распознавания речи

# serviceGemmaName
source: Gemma AI model
es: Modelo Gemma AI
ru: Модель Gemma

# serviceGemmaDescription
source: Loading AI model for braille translation
es: Cargando el modelo de IA para la traducción braille
ru: Загружаем модель ИИ для перевода в Брайль

source: Speech recognition ready
es: El reconocimiento de voz está listo
ru: Распознавание речи готово

# gemmaDownloading
source: Downloading model... {progress}
es: Descargando modelo... {progress}
ru: Загрузка модели... {progress}

# gemmaInitializing
source: Initializing AI model...
es: Inicializando el modelo de IA...
ru: Инициализация модели ИИ...

# gemmaReady
source: AI model ready
es: El modelo de IA está listo
ru: Модель ИИ готова

# vibrationUnavailableError
source: Vibration not available on this device
es: La vibración no está disponible en este dispositivo
ru: Вибрация недоступна на этом устройстве

# vibrationUnavailableFix
source: This device does not support vibration. The app will work without haptic feedback.
es: Este dispositivo no admite vibración. La app funcionará sin respuesta háptica.
ru: Приложение продолжит работу без тактильной отдачи.

# vibrationCheckFailedError
source: Failed to check vibration capabilities: {error}
es: No se pudo comprobar la vibración: {error}
ru: Не удалось проверить вибрацию: {error}

# vibrationCheckFailedFix
source: Please ensure your device supports vibration and try restarting the app.
es: Asegúrate de que tu dispositivo admite vibración e intenta reiniciar la app.
ru: Убедитесь, что устройство поддерживает вибрацию, и перезапустите приложение.

# cameraInitFailedError
source: Failed to initialize camera service
es: No se pudo iniciar el servicio de cámara
ru: Не удалось инициализировать камеру

# cameraInitFailedFix
source: Please ensure your device has camera capabilities enabled in system settings.
es: Asegúrate de que la cámara esté habilitada en los ajustes del sistema.
ru: Проверьте, что камера включена в настройках устройства.

# cameraInitError
source: Camera service initialization error: {error}
es: Error al iniciar la cámara: {error}
ru: Ошибка инициализации камеры: {error}

# cameraInitErrorFix
source: Go to Settings > Privacy & Security > Camera and ensure it's enabled.
es: Ve a Ajustes > Privacidad y seguridad > Cámara y comprueba que esté activada.
ru: Откройте «Настройки» > «Конфиденциальность и безопасность» > «Камера» и включите доступ.

# ttsInitFailedError
source: Failed to initialize text-to-speech
es: No se pudo iniciar texto a voz
ru: Не удалось инициализировать синтез речи

# ttsInitFailedFix
source: Please ensure your device has TTS capabilities enabled in system settings.
es: Asegúrate de que el dispositivo tenga texto a voz habilitado en los ajustes.
ru: Убедитесь, что синтез речи включён в системных настройках.

# ttsInitError
source: TTS initialization error: {error}
es: Error al iniciar texto a voz: {error}
ru: Ошибка инициализации синтеза речи: {error}

# ttsInitErrorFix
source: Go to Settings > Accessibility > Text-to-Speech and ensure it's enabled.
es: Ve a Ajustes > Accesibilidad > Texto a voz y comprueba que esté activado.
ru: Откройте «Настройки» > «Специальные возможности» > «Синтез речи» и включите его.

# speechInitFailedError
source: Failed to initialize speech recognition
es: No se pudo iniciar el reconocimiento de voz
ru: Не удалось инициализировать распознавание речи

# speechInitFailedFix
source: Please ensure your device has speech recognition capabilities enabled in system settings.
es: Asegúrate de que el reconocimiento de voz esté habilitado en los ajustes del sistema.
ru: Включите распознавание речи в системных настройках и повторите попытку.

# speechInitError
source: Speech recognition initialization error: {error}
es: Error al iniciar el reconocimiento de voz: {error}
ru: Ошибка инициализации распознавания речи: {error}

# speechInitErrorFix
source: Go to Settings > Privacy & Security > Speech Recognition and ensure it's enabled.
es: Ve a Ajustes > Privacidad y seguridad > Reconocimiento de voz y comprueba que esté activado.
ru: Настройки > Конфиденциальность и безопасность > Распознавание речи — включите доступ.

# gemmaInitError
source: Gemma initialization error: {error}
es: Error al iniciar Gemma: {error}
ru: Ошибка инициализации Gemma: {error}

# gemmaUnknownError
source: Unknown error
es: Error desconocido
ru: Неизвестная ошибка

# gemmaFixNetwork
source: Check your internet connection and try again. The AI model needs to be downloaded on first use.
es: Comprueba tu conexión a internet e inténtalo de nuevo. El modelo debe descargarse la primera vez.
ru: Проверьте подключение к интернету и повторите попытку — модель нужно скачать при первом запуске.

# gemmaFixCorrupted
source: The model file is corrupted. Tap "Retry" to clear and re-download the model.
es: El archivo del modelo está dañado. Pulsa «Reintentar» para borrarlo y descargarlo otra vez.
ru: Файл модели повреждён. Нажмите «Повторить», чтобы перекачать его.

# gemmaFixStorage
source: Free up storage space on your device. The AI model requires about 2GB of space.
es: Libera espacio de almacenamiento en el dispositivo. El modelo necesita unas 2 GB.
ru: Освободите около 2 ГБ памяти для модели.

# gemmaFixRestart
source: Try restarting the app. If the problem persists, clear app data and try again.
es: Intenta reiniciar la app. Si continúa el problema, borra los datos de la app e inténtalo otra vez.
ru: Перезапустите приложение. Если проблема не исчезнет, очистите данные и попробуйте снова.

# defaultBrailleOutputTitle
source: BRAILLE OUTPUT
es: SALIDA BRAILLE
ru: БРАЙЛЕВСКИЙ ВЫВОД
